HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/Sensor-Receiver/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION_2=y

# Setzt den maximalen Log-Level auf Debug (4)
#CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
#CONFIG_LOG_MAXIMUM_LEVEL=4